app/views/services/_list_services.html.erb

<p />
<%= link_to "New service", :action => "new_service" unless !["SA","Administrator"].include?(session[:user_type])%>
---
SELECT `services`.* FROM `services` WHERE (user_id = '3')

            <td class="tgate"><%=h i.content_type %></td>
            <td class="tgate"><%=h "#{ShortCode.find(i.user_short_code_id).code} (#{ShortCode.find(i.user_short_code_id).smsc})"  %></td>
---
SELECT `short_codes`.* FROM `short_codes` WHERE `short_codes`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1