app/views/services/edit_service.html.erb

SELECT `services`.* FROM `services` WHERE (id = '4') LIMIT 1
---
            <td>User:</td>
            <td><%= collection_select :service, :user_id, User.find(:all),
                :id, :name, :prompt => "Select" %></td>

SELECT `short_codes`.* FROM `short_codes` WHERE (code != 'All')
---
          <td>Short code:</td>
          <td><%= collection_select :service, :user_short_code_id, ShortCode.find(:all, :conditions => "code != 'All'"),
              :id, :short_code_with_smsc, :prompt => "Select" %></td>