app/views/services/new_service.html.erb

          <td>Short code:</td>
          <td><%= collection_select :service, :user_short_code_id, ShortCode.find(:all, :conditions => "code != 'All'"),
              :id, :short_code_with_smsc, :prompt => "Select" %></td>
---
SELECT `user_short_codes`.* FROM `user_short_codes` WHERE (short_code_id=2 and user_id=3) LIMIT 1