app/views/messages/index.html.erb

SELECT COUNT(*) FROM `inbound_messages` WHERE (service_id = '1' and date(created_at) = curdate())
---
  <% @service.each do |i| %>
    <% @sum = @sum + InboundMessage.where("service_id = '#{i.id}' and date(created_at) = curdate()").count%>