app/views/messages/new_message.html.erb

        <tr>
          <td>Short code</td><td><%= collection_select 'message', 'dest',
              ShortCode.find(:all, :conditions => @conditions, :joins => "left join user_short_codes on user_short_codes.short_code_id=short_codes.id",	:select => "user_short_codes.user_id, short_codes.code, short_codes.id, short_codes.smsc"), :id, :short_code_with_smsc %></td>
---
SELECT user_short_codes.user_id, short_codes.code, short_codes.id, short_codes.smsc FROM `short_codes` left join user_short_codes on user_short_codes.short_code_id=short_codes.id WHERE (code != 'All')

          <td>Group</td>
          <td><%= collection_select :message, :group_id, Group.find(:all, :conditions => "user_id='#{session[:user_id]}'"), :id, :name, :prompt => "Select" %>
---
SELECT `groups`.* FROM `groups` WHERE (user_id='1')