app/views/users/_list_users.html.erb

SELECT `users`.* FROM `users`
---
<p/>
<%= link_to "New user",:action => "new_user" unless !["SA","Administrator"].include?(session[:user_type])%>

SELECT `user_details`.* FROM `user_details` WHERE (user_id = '1' and parent=true) LIMIT 1
---
        <tr>
          <% parent = UserDetail.find(:first, :conditions => "user_id = '#{i.id}' and parent=true")%>

SELECT `short_codes`.* FROM `short_codes` WHERE `short_codes`.`id` = 1 LIMIT 1
---
            <td><%= i.phone_no %></td>
            <% short_codes = UserShortCode.find(:all, :conditions => "user_id = #{i.id}")%>