app/views/settings/assign_short_code.html.erb

SELECT `user_short_codes`.* FROM `user_short_codes` WHERE (short_code_id ='' and user_id='') LIMIT 1
---
            <td>Short code:</td>
            <td><%= collection_select :user_short_code, :short_code_id, ShortCode.find(:all, :conditions => "code != 'All'"),
                :id, :short_code_with_smsc, :prompt => "Select" %></td>