app/views/report/index.html.erb

                <th align ='left'>Service</th>
                <td><%= collection_select 'inbound', 'rep_service', Service.find(:all, :conditions => "user_id=#{session[:user_id]}"), :id, :name, :prompt => "Select" %></td>
---
SELECT `services`.* FROM `services` WHERE (user_id=1)