app/controllers/login_controller.rb

  def login
    session[:user_id] = nil
    if request.post?
      user = UserDetail.authenticate(params[:username], params[:password])
      if user
      	if user.parent == true
          session[:user_id] = user.user.id
          session[:user_type] = user.user.user_type
          session[:name] = user.user.name
          short_codes = ShortCode.select("user_short_codes.user_id, short_codes.code, short_codes.id").joins("left join user_short_codes on user_short_codes.short_code_id=short_codes.id").where("user_short_codes.user_id = #{session[:user_id]}")
---
SELECT user_short_codes.user_id, short_codes.code, short_codes.id FROM `short_codes` left join user_short_codes on user_short_codes.short_code_id=short_codes.id WHERE (user_short_codes.user_id = 1)