app/controllers/messages_controller.rb

	def index
		case session[:user_type]
    when "SA" then
      conditions = ""
    when "Administrator" then
      conditions = ""
    when "Service-Aggregator" then
      conditions = "user_id = '#{session[:user_id]}'"
    when "Bulk-push" then
      conditions = "user_id = '#{session[:user_id]}'"
    when "Moderator" then
      @user_mod = UserModService.where("user_mod_id=#{session[:user_id]}")
      sel = ''
      conditions = ''
      @user_mod.each do |i|
---
SELECT `services`.* FROM `services` WHERE (user_id = '3')
SELECT `services`.* FROM `services`

	def inbound
		case session[:user_type]
    when "SA" then
      conditions = ""
    when "Administrator" then
      conditions = ""
    when "Service-Aggregator" then
      conditions = "user_id = '#{session[:user_id]}'"
    when "Bulk-push" then
      conditions = "user_id = '#{session[:user_id]}'"
    when "Moderator" then
      @user_mod = UserModService.where("user_mod_id=#{session[:user_id]}")
      sel = ''
      conditions = ''
      @user_mod.each do |i|
---
SELECT `services`.* FROM `services` WHERE `services`.`id` = 1 LIMIT 1
SELECT `services`.* FROM `services` ORDER BY name ASC

	def outbound
		case session[:user_type]
    when "SA" then
      conditions = ""
    when "Administrator" then
      conditions = ""
    when "Service-Aggregator" then
      conditions = "user_id = '#{session[:user_id]}'"
    when "Bulk-push" then
      conditions = "user_id = '#{session[:user_id]}'"
    when "Moderator" then
      @user_mod = UserModService.where("user_mod_id=#{session[:user_id]}")
      sel = ''
      conditions = ''
      @user_mod.each do |i|
---
SELECT `services`.* FROM `services` ORDER BY name ASC

  def view_inbound_message
    @inbound_message = InboundMessage.where("id = '#{params[:id]}'").first
    @outbound_message = OutboundMessage.where("inbound_id = '#{params[:id]}'").first
---
SELECT `inbound_messages`.* FROM `inbound_messages` WHERE (id = '205') LIMIT 1
SELECT `outbound_messages`.* FROM `outbound_messages` WHERE (inbound_id = '205') LIMIT 1

  def view_outbound_message
    @outbound_message = OutboundMessage.where("id = '#{params[:id]}'").first
---
SELECT `outbound_messages`.* FROM `outbound_messages` WHERE (id = '166') LIMIT 1

  def send_message
    destination = ShortCode.find(params[:message][:dest])
    stock = User.find(session[:user_id])
---
SELECT `short_codes`.* FROM `short_codes` WHERE `short_codes`.`id` = 2 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def send_sms_service
    if !params[:from].nil? and !params[:to].nil?  and !params[:user].nil? and !params[:pass].nil? and !params[:text].nil?
      short_code = ShortCode.find_by_code(params[:from])
      user_auth = UserDetail.authenticate(params[:user], params[:pass])
      if user_auth
        if short_code
          user = User.find_by_id(user_auth.user_id)
          if user.user_type != "SA"
            short_code_auth = UserShortCode.find_by_user_id_and_short_code_id(user_auth.user_id, short_code.id)
---
SELECT `short_codes`.* FROM `short_codes` WHERE `short_codes`.`code` = '44801' LIMIT 1
SELECT `user_details`.* FROM `user_details` WHERE `user_details`.`id` IS NULL LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `user_short_codes`.* FROM `user_short_codes` WHERE `user_short_codes`.`user_id` = 1 AND `user_short_codes`.`short_code_id` = 3 LIMIT 1