app/controllers/report_controller.rb

  def summary


    params[:date_from] = self.convert_date(params[:date_from])
		params[:date_to] = self.convert_date(params[:date_to])

    case session[:user_type]
    when "SA" then
      conditions = ""
    when "Administrator" then
      conditions = ""
    when "Service-Aggregator" then
      conditions = "user_id = '#{session[:user_id]}' and "
    when "Bulk-push" then
      conditions = "user_id = '#{session[:user_id]}' and "
    when "Moderator" then
      @user_mod = UserModService.where("user_mod_id=#{session[:user_id]} and ")
      sel = ''
      conditions = ''
      @user_mod.each do |i|
			 	sel = sel + "'" + i.service_id.to_s + "'" + ","
      end
      sel = sel.slice(0, sel.length()-1)
      conditions = "id in('#{sel}')" unless @user_mod.nil?
      conditions = "id in('')" unless sel != nil
		end

		#inbound = InboundMessage.where("#{conditions}date(inbound_messages.created_at) >= '#{params[:date_from]})' and date(inbound_messages.created_at) <= '#{params[:date_to]}'").joins("left join short_codes on short_codes.code=inbound_messages.destination").count
    #outbound = OutboundMessage.where("#{conditions}date(outbound_messages.created_at) >= '#{params[:date_from]})' and date(outbound_messages.created_at) <= '#{params[:date_to]}'").joins("left join short_codes on short_codes.code=outbound_messages.destination").count

    inbound = InboundMessage.joins("left join services on inbound_messages.service_id=services.id left join short_codes on short_codes.code=inbound_messages.destination").select("inbound_messages.user_id,inbound_messages.smsc, services.name, inbound_messages.sender,inbound_messages.destination, inbound_messages.content, inbound_messages.service_status, short_codes.sms_cost,inbound_messages.created_at").where("#{conditions}date(inbound_messages.created_at) >= '#{params[:date_from]})' and date(inbound_messages.created_at) <= '#{params[:date_to]}'")
    outbound = OutboundMessage.joins("left join services on outbound_messages.service=services.name join short_codes on short_codes.code=outbound_messages.sender").select("outbound_messages.user_id,outbound_messages.service, outbound_messages.sender,outbound_messages.destination, outbound_messages.content, outbound_messages.status, short_codes.sms_cost,outbound_messages.created_at").where("#{conditions}date(outbound_messages.created_at) >= '#{params[:date_from]})' and date(outbound_messages.created_at) <= '#{params[:date_to]}'")

    short_codes = ShortCode.where("code != 'all'")
---
SELECT `services`.* FROM `services` WHERE (id != 1)
SELECT `services`.* FROM `services`
SELECT `services`.* FROM `services` left join user_short_codes on user_short_codes.user_id=1
SELECT inbound_messages.user_id,inbound_messages.smsc, services.name, inbound_messages.sender,inbound_messages.destination, inbound_messages.content, inbound_messages.service_status, short_codes.sms_cost,inbound_messages.created_at FROM `inbound_messages` left join services on inbound_messages.service_id=services.id left join short_codes on short_codes.code=inbound_messages.destination WHERE (date(inbound_messages.created_at) >= '2012-03-01)' and date(inbound_messages.created_at) <= '2012-03-12') AND (service_id=1) GROUP BY inbound_messages.destination LIMIT 1
SELECT outbound_messages.service, outbound_messages.sender,outbound_messages.destination, outbound_messages.content, outbound_messages.status, short_codes.sms_cost,outbound_messages.created_at FROM `outbound_messages` left join services on outbound_messages.service=services.name join short_codes on short_codes.code=outbound_messages.sender WHERE (date(outbound_messages.created_at) >= '2012-03-06)' and date(outbound_messages.created_at) <= '2012-03-12')
SELECT `short_codes`.* FROM `short_codes` WHERE (code != 'all')

        csv << ["", "Unit price", code.sms_cost]
        csv << ["", "Inbound", inbound.where("destination='#{code.code}'").count]
        csv << ["", "Outbound", outbound.where("sender='#{code.code}'").count]
        users = User.order("name ASC")
        users.each do |user|
---
SELECT `users`.* FROM `users` ORDER BY name ASC
SELECT `users`.* FROM `users`

      csv << [""]
      csv << ["#{inbound.where("service_id=1").group("inbound_messages.smsc").first.smsc} [unknown services]"]
      csv << ["","Short Code",inbound.where("service_id=1").group("inbound_messages.destination").first.destination]
      csv << ["", "Inbound", inbound.where("service_id=1").count]
---
SELECT COUNT(*) FROM `inbound_messages` WHERE (date(inbound_messages.created_at) >= '2012-03-12)' and date(inbound_messages.created_at) <= '2012-03-12' and destination='44800')