app/controllers/service_manager_controller.rb

  def request_handler
  	t1 = Thread.new() {
	  	if request.env["HTTP_USER_AGENT"] == "Kannel/1.4.3"
        if params[:smsc] != nil or params[:content] != nil or params[:sender] != nil or params[:keyword] != nil
          if params[:content].split(/ /).length() == 1 and params[:content].downcase.gsub(" ","").slice(0,1) == "m"
            params[:keyword] = "m"
            params[:content] = "m #{params[:content].slice(1,params[:content].length())}"
          end

          @service  = Service.find(:first, :conditions => "keyword = '#{params[:keyword]}' or aliases like '%#{params[:keyword]}%'",
            :joins => "left join short_codes on short_codes.code='#{params[:destination]}'",
            :select => "services.id as service_id, services.user_id, services.status, services.content_type, services.reply, services.reply_content, services.web_service_id,services.user_short_code_id, services.name, services.keyword, services.aliases, short_codes.id, short_codes.code, short_codes.smsc")
          #@code = ShortCode.find(:first, :conditions => "user_short_codes.user_id = #{@service.user_id} and code != 'All'",
					#	:joins => "left join user_short_codes on user_short_codes.short_code_id=#{@service.user_short_code_id}",
					#	:select => "user_short_codes.user_id, short_codes.code, short_codes.id, short_codes.smsc") unless @service.nil?

          if @service != nil and @service.code == params[:destination]
		      	req = InboundMessage.create(:smsc => @service.smsc,
              :user_id => @service.user_id,
              :service_id => @service.service_id,
              :sender => params[:sender],
              :destination => params[:destination],
              :content => params[:content],
              :created_at => Time.now(),
              :service_status => "pending")
		      	short_code = params[:destination]

		      	@result = "Incoming message successfuly recorded
		      						| content : #{params[:content]}"
		      	if @service.status == true
              short = ShortCode.find_by_id(@service.user_short_code_id)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT services.id as service_id, services.user_id, services.status, services.content_type, services.reply, services.reply_content, services.web_service_id,services.user_short_code_id, services.name, services.keyword, services.aliases, short_codes.id, short_codes.code, short_codes.smsc FROM `services` left join short_codes on short_codes.code='44800' WHERE (keyword = 'lol' or aliases like '%lol%') LIMIT 1
SELECT user_short_codes.user_id, short_codes.code, short_codes.id, short_codes.smsc FROM `short_codes` left join user_short_codes on user_short_codes.short_code_id=short_codes.id WHERE (user_short_codes.user_id = 2 and code != 'All') LIMIT 1
INSERT INTO `inbound_messages` (`content`, `created_at`, `destination`, `read_status`, `sender`, `service_id`, `service_status`, `smsc`, `status_message`, `updated_at`, `user_id`) VALUES ('test', '2012-03-12 18:47:47', '44800', 0, '+250788460106', 3, 'pending', 'Vodacom DRC', '', '2012-03-12 18:47:47', 2)
SELECT `inbound_messages`.* FROM `inbound_messages` WHERE (replace(sender,'+','') = '250788462143' and service_id = 5 and service_status='success') LIMIT 1

	def record_push
		case params[:status]
    when "0" then @status = "Accepted for delivery"
    when "1" then @status = "delivered"
    when "2" then @status = "failed"
    when "4" then @status = "buffered"
    when "8" then @status = "submitted"
    when "16" then @status = "rejected"
		end

    OutboundMessage.create(:inbound_id => params[:inbound_id],
      :user_id => params[:user_id], :service => params[:service],
      :sender => params[:sender], :destination => params[:dest],
      :content => params[:content], :status => @status,
      :status_message => @status)
---
INSERT INTO `outbound_messages` (`content`, `created_at`, `destination`, `inbound_id`, `sender`, `service`, `status`, `status_message`, `updated_at`, `user_id`) VALUES ('Testing', '2012-03-12 18:47:48', ' 250788460106', 2, '44800', 'test', 'delivered', 'delivered', '2012-03-12 18:47:48', 2)

  def get_ringtone(val, req, web_service)
    puts "#{val}"
    key = val[3].split(/=/)[1].gsub(" ","").gsub("m", "").gsub("M","")
    if !key.nil?
      ringtone = Ringtone.where("keyword='#{key}' or aliases='#{key}'").first
      if !ringtone.nil?
        if ringtone.status
          secret_key = RingtoneAccessKey.random_key(4)
          RingtoneAccessKey.create(:ringtone_id => ringtone.id,
            :key => secret_key,
            :expires_at => Time.now() + 360,
            :req_status => "unused")
---
SELECT `ringtones`.* FROM `ringtones` WHERE (keyword like '%1%') LIMIT 1
INSERT INTO `ringtone_access_keys` (`created_at`, `expires_at`, `key`, `req_status`, `ringtone_id`, `updated_at`, `used_at`) VALUES ('2012-05-03 13:26:11', '2012-05-03 13:28:11', '9176', 'unused', 1, '2012-05-03 13:26:11', NULL)

  def get_unique_identifier(val, req, web_service)
    puts "#{val}"
    origin = val[0].split(/=/)[1]
    destination = val[1].split(/=/)[1]
    message = val[2].split(/=/)[1]
    service = val[3].split(/=/)[1]
    exists = InboundMessage.where("replace(sender,'+','') = '#{origin.gsub('+','')}' and service_id = #{service} and service_status='success'").first
    if exists.nil?
      req.update_attribute(:service_status, "success")
      counter = InboundMessage.where("service_id = #{service} and service_status = 'success'").count()
      uid = "RF_".concat("#{counter}/".rjust(9,'0')).concat(Time.now.strftime('%d%m%Y').to_s)
      name = "#{message.split(/ /)[1]} #{message.split(/ /)[2]}"
      @result = "Felicitation,PRO-YEN garantit votre insertion professionnelle dans le circuit traditionnel et autre.\nNumero d'identification: #{uid}"
    else
      req.update_attribute(:service_status, "failed")
      message = OutboundMessage.find_by_inbound_id(exists.id)
---
SELECT `inbound_messages`.* FROM `inbound_messages` WHERE (replace(sender,'+','') = '250788460106' and service_id = 5 and service_status='success') LIMIT 1
SELECT `outbound_messages`.* FROM `outbound_messages` WHERE `outbound_messages`.`inbound_id` = 113 LIMIT 1