app/controllers/services_controller.rb

	def index
    case session[:user_type]
    when "SA" then
      conditions = ""
    when "Administrator" then
      conditions = ""
    when "Service-Aggregator" then
      conditions = "user_id = '#{session[:user_id]}'"
    when "Bulk-push" then
      conditions = "user_id = '#{session[:user_id]}'"
		end
		@services = Service.find(:all, :conditions => conditions)
		@user_mod = UserDetail.where("user_id='#{session[:user_id]}' and parent != 1").order('created_at DESC')
---
SELECT `services`.* FROM `services` WHERE (user_id = '3')
SELECT `user_details`.* FROM `user_details` WHERE (user_id='1' and parent != 1) ORDER BY created_at DESC

	def list
		case session[:user_type]
    when "SA" then
      conditions = ""
    when "Administrator" then
      conditions = ""
    when "Service-Aggregator" then
      conditions = "user_id = '#{session[:user_id]}'"
    when "Bulk-push" then
      conditions = "user_id = '#{session[:user_id]}'"
		end
		@services = Service.find(:all, :conditions => conditions)
		@user_mod = UserDetail.where("user_id='#{session[:user_id]}' and parent != 1").order('created_at DESC')
---
SELECT `user_details`.* FROM `user_details` WHERE (user_id='1' and parent != 1) ORDER BY created_at DESC

	def new_service
		@service = Service.new(params[:service])
		if @service.web_service_id == nil
			@service.web_service_id = 1
		end
    if request.post?

      user = UserShortCode.where("short_code_id=#{@service.user_short_code_id} and user_id=#{@service.user_id}").first
      if user
        if request.post? and @service.save
---
SELECT `user_short_codes`.* FROM `user_short_codes` WHERE (short_code_id=2 and user_id=3) LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `services` (`aliases`, `content_type`, `created_at`, `keyword`, `name`, `reply`, `reply_content`, `status`, `updated_at`, `user_id`, `user_short_code_id`, `web_service_id`) VALUES ('tesy;tety;tezo', 'Static', '2012-03-12 18:45:23', 'test', 'Test', 1, 'Testing', 0, '2012-03-12 18:45:23', 2, 2, 1)

  def edit_service
    @service = Service.find(:first, :conditions => "id = '#{params[:id]}'")
---
SELECT `services`.* FROM `services` WHERE (id = '4') LIMIT 1

  def update_service
    @service = Service.find(params[:id])
    if @service.update_attributes(params[:service])
---
SELECT `services`.* FROM `services` WHERE `services`.`id` = 4 LIMIT 1
UPDATE `services` SET `user_short_code_id` = 3, `updated_at` = '2012-03-12 19:29:22' WHERE `services`.`id` = 6

  def enable_service

    @service = Service.find(params[:id])
    @service.update_attribute(:status, true)
---
SELECT `services`.* FROM `services` WHERE `services`.`id` = 3 LIMIT 1
UPDATE `services` SET `status` = 1, `updated_at` = '2012-03-12 18:45:25' WHERE `services`.`id` = 3