app/controllers/settings_controller.rb

	def index
		@status = 0
    @user_short_codes = UserShortCode.order('created_at DESC')
    @short_codes = ShortCode.order('created_at DESC')
    @web_services = WebService.order('created_at DESC')
    @ringtones = Ringtone.order('keyword DESC')
---
SELECT `user_short_codes`.* FROM `user_short_codes` ORDER BY created_at DESC
SELECT `web_services`.* FROM `web_services` ORDER BY created_at DESC
SELECT `ringtones`.* FROM `ringtones` ORDER BY keyword DESC

	def new_short_code
		@short_code = ShortCode.new(params[:short_code])
		@exists = ShortCode.where("code ='#{@short_code.code}' and smsc='#{@short_code.smsc}'").first
---
SELECT `short_codes`.* FROM `short_codes` WHERE (code ='' and smsc='') LIMIT 1

	def assign_short_code
		@user_short_code = UserShortCode.new(params[:user_short_code])
		@exists = UserShortCode.find(:first, :conditions => "short_code_id ='#{@user_short_code.short_code_id}' and user_id='#{@user_short_code.user_id}'")
		if @exists.nil?
	    if request.post? and @user_short_code.save
---
SELECT `user_short_codes`.* FROM `user_short_codes` WHERE (short_code_id ='' and user_id='') LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `user_short_codes` (`created_at`, `short_code_id`, `updated_at`, `user_id`) VALUES ('2012-03-12 19:00:52', 2, '2012-03-12 19:00:52', 3)

	def new_web_service
		@web_service = WebService.new(params[:web_service])
		if request.post? and @web_service.save
---
INSERT INTO `web_services` (`created_at`, `default_param`, `name`, `param1`, `param10`, `param2`, `param3`, `param4`, `param5`, `param6`, `param7`, `param8`, `param9`, `post_xml_format`, `updated_at`, `web_service_type`, `web_service_uri`) VALUES ('2012-05-03 13:38:09', 0, 'tes', '', '', '', '', '', '', '', '', '', '', '', '2012-05-03 13:38:09', 'Get-URL(1)', 'http://localhost:3001/service_manager/testing?')

	def edit_web_service
		@web_service = WebService.find(params[:id])
---
SELECT `web_services`.* FROM `web_services` WHERE `web_services`.`id` = 2 LIMIT 1

	def update_web_service
		@web_service = WebService.find(params[:id])
	  if @web_service.update_attributes(params[:web_service])
---
SELECT `web_services`.* FROM `web_services` WHERE `web_services`.`id` = 4 LIMIT 1
UPDATE `web_services` SET `default_param` = 0, `updated_at` = '2012-05-03 13:22:42' WHERE `web_services`.`id` = 4