app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def index #list system users
    #flash[:notice] = nil
    @users = User.find(:all)

INSERT INTO `users` (`created_at`, `email`, `name`, `phone_no`, `sms_limit`, `sms_stock`, `updated_at`, `user_type`) VALUES ('2012-03-12 18:49:30', 'mutesach@gmail.com', 'Christian Mutesa', '250788460106', 0, 0, '2012-03-12 18:49:30', 'Bulk-push')
INSERT INTO `user_details` (`created_at`, `hashed_password`, `parent`, `salt`, `status`, `updated_at`, `user_id`, `username`) VALUES ('2012-03-12 18:49:30', 'eaedc5bd78b699fe8f7cdb39bb85e21873581a7f', 1, '343717800.8636894537685786', 0, '2012-03-12 18:49:30', NULL, 'mutesa')
INSERT INTO `groups` (`created_at`, `name`, `updated_at`, `user_id`) VALUES ('2012-03-12 18:49:31', 'default', '2012-03-12 18:49:31', 3)
---
  def save_user
    @user = User.new(params[:user])
    @user_detail = UserDetail.new(params[:user_detail])
    #if params[:user][:short_code_id] == ""
    #	@user.short_code_id = 0
   	#end
    if request.post? and @user.save
      @user_detail.save
    	@user_detail.update_attribute(:user_id, @user.id)
    	Group.create(:user_id => @user.id, :name => "default", :created_at => Time.now())

SELECT `user_details`.* FROM `user_details` WHERE `user_details`.`id` = 1 LIMIT 1
---
  def edit_user
    @user = UserDetail.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `user_details`.* FROM `user_details` WHERE (user_id='2' and parent=true) LIMIT 1
---
	def edit_user_profile
    @user = User.find(params[:id])
    @user_detail = UserDetail.find(:first, :conditions => "user_id='#{@user.id}' and parent=true")

SELECT `user_details`.* FROM `user_details` WHERE `user_details`.`id` = 1 LIMIT 1
UPDATE `user_details` SET `salt` = '383087800.7744760415322167', `hashed_password` = 'c352b1b5b04db1c94c556fec7457a4301bce4b63', `updated_at` = '2012-05-03 08:19:34' WHERE `user_details`.`id` = 2
---
  def change_password
    @user = UserDetail.find(params[:id])
    @expected_password = UserDetail.encrypted_password(params[:user_detail][:password],
      @user.salt)
    if request.post? and @user.update_attributes(params[:user_detail])

SELECT `user_details`.* FROM `user_details` WHERE `user_details`.`id` = 1 LIMIT 1
UPDATE `user_details` SET `status` = 1, `updated_at` = '2012-03-12 18:49:33' WHERE `user_details`.`id` = 3
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def activate_user
    @status = UserDetail.find(params[:id])
    @status.update_attribute(:status, true)
    flash[:notice] = "User #{@status.user.name} successfuly activated!"
    @users = User.find(:all)